code-review/NRB_3471_3546/База_Стало/DataProcessors/ВыгрузкаКотировокВBackQort.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаКотировокВBackQort</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ВидыДействийВыгрузкиКотировокВBackQort.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДействийВыгрузкиКотировокВBackQort</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузитьЗагруженныеКотировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузитьКотировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ПериодыДней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПериодыДней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредыдущийДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредыдущийРабочийДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ВыгрузкаКотировокВBackQort/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура для регламентной выгрузки котировок в BackQort
//
// Параметры:
//  Действие					 - ПеречислениеСсылка.ВидыДействийВыгрузкиКотировокВBackQort	 - Вид действия для выгрузки
//  ТипПериодаВыгрузкиКотировок	 - ПеречислениеСсылка.ПериодыДней								 - Тип периода для выгрузки
//
Процедура ВыгрузитьКотировкиРегламентно(Действие, ТипПериодаВыгрузкиКотировок) Экспорт
	
	ПустаяДата = Дата(1, 1, 1);
	ТекстыОшибок = Новый Массив;
	ИсточникиКотировок = ВыгружаемыеИсточникиКотировок();
	
	Для Каждого ИсточникКотировок Из ИсточникиКотировок Цикл
		ПараметрыВыгрузки = ПараметрыВыгрузкиКотировок(Действие, ИсточникКотировок, ТипПериодаВыгрузкиКотировок);
		
		Если ЗначениеЗаполнено(ПараметрыВыгрузки.НачалоПериода) И ЗначениеЗаполнено(ПараметрыВыгрузки.КонецПериода) Тогда
			
			Если ПараметрыВыгрузки.КонецПериода < ПараметрыВыгрузки.НачалоПериода Тогда
				ФорматДаты = "ДФ=dd.MM.yyyy";
				НачалоПериодаСтрока = Формат(ПараметрыВыгрузки.НачалоПериода, ФорматДаты);
				КонецПериодаСтрока = Формат(ПараметрыВыгрузки.КонецПериода, ФорматДаты);
				ТекстОшибки = СтрШаблон("Некорректный период для выгрузки котировок в BackQort: с %1 по %2 для %3,
					|см. ""Параметры выгрузки котировок в BackQort"" в обработке ""Выгрузка котировок в BackQort""",
					НачалоПериодаСтрока, КонецПериодаСтрока, ИсточникКотировок);
				ТекстыОшибок.Добавить(ТекстОшибки);
			Иначе
				
				ОбработкаВыгрузкаКотировокВBackQort = Обработки.ВыгрузкаКотировокВBackQort.Создать();
				ОбработкаВыгрузкаКотировокВBackQort.НачалоПериода = ПараметрыВыгрузки.НачалоПериода;
				ОбработкаВыгрузкаКотировокВBackQort.КонецПериода = ПараметрыВыгрузки.КонецПериода;
				ОбработкаВыгрузкаКотировокВBackQort.Биржа = ИсточникКотировок;
				
				Попытка
					ОбработкаВыгрузкаКотировокВBackQort.ВыгрузитьВBackQort();
					СохранитьНастройкуВыгрузки(ИсточникКотировок, ПараметрыВыгрузки.ДатаВыгрузки, ПустаяДата);
				Исключение
					ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстыОшибок.Добавить(ТекстОшибки);
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстыОшибок) Тогда
		ИтоговыйТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
		ВызватьИсключение ИтоговыйТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает список выгружаемых источников котировок
// 
// Возвращаемое значение:
//  Массив - Массив из элементов справочника ИнформационноАналитическиеСистемы
//
Функция ВыгружаемыеИсточникиКотировок() Экспорт
	ИсточникиКотировок = Новый Массив;
	ИсточникиКотировок.Добавить(Справочники.ИнформационноАналитическиеСистемы.НРД);
	ИсточникиКотировок.Добавить(Справочники.ИнформационноАналитическиеСистемы.CBonds);
	Возврат ИсточникиКотировок;
КонецФункции

// Процедура сохраняет настройки выгрузки по заданному источнику котировок
//
// Параметры:
//  ИсточникКотировок					 - СправочникСсылка.ИнформационноАналитическиеСистемы - Источник котировок для сохранения настроек
//  ПоследняяУспешнаяВыгрузкаКотировок	 - Дата - Новое значение настройки ПоследняяУспешнаяВыгрузкаКотировок
//  ДатаКотировокКВыгрузке				 - Дата - Новое значение настройки ДатаКотировокКВыгрузке
//
Процедура СохранитьНастройкуВыгрузки(ИсточникКотировок, ПоследняяУспешнаяВыгрузкаКотировок = Неопределено,
	ДатаКотировокКВыгрузке = Неопределено) Экспорт
	
	ИмяНастройки = ИмяСохраняемыхНастроек();
	Настройки = НастройкиВыгрузки();
	Настройка = Настройки[ИсточникКотировок];
	Настройка.ПоследняяУспешнаяВыгрузкаКотировок = ?(ПоследняяУспешнаяВыгрузкаКотировок <> Неопределено,
		ПоследняяУспешнаяВыгрузкаКотировок, Настройки[ИсточникКотировок].ПоследняяУспешнаяВыгрузкаКотировок);
	Настройка.ДатаКотировокКВыгрузке = ?(ДатаКотировокКВыгрузке <> Неопределено, ДатаКотировокКВыгрузке,
		Настройки[ИсточникКотировок].ДатаКотировокКВыгрузке);
	Настройки.Вставить(ИсточникКотировок, Настройка);
	ЭтоОбщаяНастройка = Истина;
	УниверсальныеМеханизмы.СохранитьНастройку(ИмяНастройки, Настройки, ЭтоОбщаяНастройка);
	
КонецПроцедуры

// Функция возвращает все настройки выгрузки
// 
// Возвращаемое значение:
//  Соответствие - см. НовыеНастройки
//
Функция НастройкиВыгрузки() Экспорт
	ИмяНастройки = ИмяСохраняемыхНастроек();
	ЭтоОбщаяНастройка = Истина;
	Настройки = УниверсальныеМеханизмы.ВосстановитьНастройку(ИмяНастройки, ЭтоОбщаяНастройка);
	Если Настройки = Неопределено Тогда
		Настройки = НовыеНастройки();
	КонецЕсли;
	Возврат Настройки;
КонецФункции

// Функция возвращает настройки выгрузки для заданного источника котировок
//
// Параметры:
//  ИсточникКотировок	 - СправочникСсылка.ИнформационноАналитическиеСистемы - Источник котировок для получения настроек
// 
// Возвращаемое значение:
//  Структура - см. НовыеНастройки
//
Функция НастройкаВыгрузки(ИсточникКотировок) Экспорт
	Настройки = НастройкиВыгрузки();
	Настройка = Настройки[ИсточникКотировок];
	Возврат Настройка;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыВыгрузкиКотировок(Действие, ИсточникКотировок, ТипПериодаВыгрузкиКотировок)
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("НачалоПериода");
	ПараметрыВыгрузки.Вставить("КонецПериода");
	ПараметрыВыгрузки.Вставить("ДатаВыгрузки");
	
	// Если действие не указано или нужно выгрузить ранее загруженные из НРД/CBonds котировки (анализируются параметры выгрузки котировок)
	Если Действие = Неопределено Или Действие = Перечисления.ВидыДействийВыгрузкиКотировокВBackQort.ВыгрузитьЗагруженныеКотировки Тогда
		
		ЗначенияПараметров = НастройкаВыгрузки(ИсточникКотировок);
		Если ЗначениеЗаполнено(ЗначенияПараметров.ДатаКотировокКВыгрузке) Тогда
			ПараметрыВыгрузки.НачалоПериода = ?(ЗначениеЗаполнено(ЗначенияПараметров.ПоследняяУспешнаяВыгрузкаКотировок)
				И ЗначенияПараметров.ПоследняяУспешнаяВыгрузкаКотировок <> ЗначенияПараметров.ДатаКотировокКВыгрузке,
				ЗначенияПараметров.ПоследняяУспешнаяВыгрузкаКотировок + ОбщегоНазначенияПовтИсп.СекундВСутках(),
				ЗначенияПараметров.ДатаКотировокКВыгрузке);
			ПараметрыВыгрузки.КонецПериода = ЗначенияПараметров.ДатаКотировокКВыгрузке;
			ПараметрыВыгрузки.ДатаВыгрузки = ЗначенияПараметров.ДатаКотировокКВыгрузке;
		КонецЕсли;
		
	// Если нужно выгрузить котировки за период из второго параметра регзадания (ТипПериодаВыгрузкиКотировок)
	ИначеЕсли Действие = Перечисления.ВидыДействийВыгрузкиКотировокВBackQort.ВыгрузитьКотировки Тогда
		
		Если ТипПериодаВыгрузкиКотировок = Неопределено Тогда
			ТипПериодаУточненный = Перечисления.ПериодыДней.ПредыдущийРабочийДень;
		Иначе
			ТипПериодаУточненный = ТипПериодаВыгрузкиКотировок;
		КонецЕсли;
		
		ПараметрыВыгрузки.ДатаВыгрузки = Перечисления.ПериодыДней.ДатаПоТипуПериода(ТипПериодаУточненный, ТекущаяДатаСеанса());
		ПараметрыВыгрузки.НачалоПериода = ПараметрыВыгрузки.ДатаВыгрузки;
		ПараметрыВыгрузки.КонецПериода = ПараметрыВыгрузки.ДатаВыгрузки;
		
	Иначе
		ВызватьИсключение "Недопустимое значение параметра ""Действие"" регламентного задания: " + Строка(Действие);
	КонецЕсли;
	
	Возврат ПараметрыВыгрузки;
	
КонецФункции

Функция ИмяСохраняемыхНастроек()
	Возврат "ПараметрыВыгрузкиКотировокВBackQort";
КонецФункции

Функция НовыеНастройки()
	Настройки = Новый Соответствие;
	ИсточникиКотировок = ВыгружаемыеИсточникиКотировок();
	Для Каждого ИсточникКотировок Из ИсточникиКотировок Цикл
		Настройка = Новый Структура("ПоследняяУспешнаяВыгрузкаКотировок,ДатаКотировокКВыгрузке");
		Настройки.Вставить(ИсточникКотировок, Настройка);
	КонецЦикла;
	Возврат Настройки;
КонецФункции

#КонецОбласти
